"use client"

import Logo from "@/components/ui/Logo";

export default function HistoryWidget() {
  return (<>
        <Logo className="flex justify-center" imageClassName="h-50 w-50"/>
    <div className="container mx-auto px-4 py-8">
      <h1 className="text-3xl font-bold mb-6">Історія ліцею</h1>

      <div className="space-y-4">
        <p>Черкаський фізико-математичний ліцей (ФІМЛІ) було засновано у 1993 році, як перший навчальний заклад нового типу - ліцей із поглибленим вивченням математики і фізики.</p>

        <p>Мета роботи ліцею - створення сприятливих умов для навчання і розвитку молоді, обдарованої в галузі природничих наук.</p>

        <p>Девіз ліцею: «Знання учнів - запорука успіху держави в майбутньому».</p>

        <div className="my-6">
          <h2 className="text-xl font-semibold mb-3">Основні стратегічні завдання діяльності ліцею:</h2>

          <ul className="list-disc pl-6 space-y-1">
            <li>Оволодіння учнями ключовими компетентностями, необхідними для життя.</li>
            <li>Підготовка випускників до вступу у заклади вищої освіти.</li>
            <li>Наскрізний процес виховання учнів.</li>
          </ul>
        </div>

        <p>Бренд і логотип "ФІМЛІ" відомі сьогодні далеко за межами області, про нього знають у країнах СНД і далекого зарубіжжя. У 2005 році ФІМЛІ став дипломантом фінального етапу конкурсу якості «100 кращих товарів і послуг України» в номінації «освітні послуги».</p>

        <h2 className="text-xl font-semibold mt-8 mb-3">Особливості навчання</h2>

        <p>У ліцеї поглиблено вивчаються математика та фізика. Керівником ліцею з 2022 року є Зімнін Юрій Фірсович.</p>

        <p>Навчання в ліцеї триває протягом п'яти років (7-11 класи). Право навчатися у ліцеї учні здобувають за підсумками вступного тестування з математики і української мови. Частина учнів зараховується на 0-ий курс ліцею за наслідками «Олімпіади юних математиків», яка вже стала традиційною і проводиться у квітні кожного року.</p>

        <p>0-й курс (7 клас) є підготовчим до навчання у ліцеї. Учні, їх батьки, вчителі мають змогу ще раз перевірити правильність вибору профілю навчання, його відповідність здібностям та уподобанням кожного з учнів. Навчання протягом року здійснюється за звичайними шкільними програмами, але в змінених умовах дає змогу не лише подолати прогалини у знаннях учнів, але й іноді призводить до повної зміни уявлень учнів та їх батьків про можливості дитини; не тільки допомагає звикнути до відповідної системи вимог, але й сформувати навички, необхідні для подальшого поглибленого вивчення математики, фізики, інформатики та інших предметів.</p>
      </div>
    </div>
    </>
  );
}